// Решить задачу под номером 5. 
    // Задано уравнение вида q + w = e, q, w, e >= 0. Некоторые цифры могут 
    // быть заменены знаком вопроса, например 2? + ?5 = 69. Требуется восстановить 
    // выражение до верного равенства. Предложить хотя бы одно решение или сообщить, что его нет.

public class HW02Task03 {
    
    // НЕ СДЕЛАНО - гоняю, но пока не получается
    // Ищем ? и заменяем на цифру (переводя в стринг) от 0 до 9 перебором цикл в цикле 
    // и склеиваем  с 2 и 5. Потом нужно как то расчленить на цифры и знаки для проверки равенства
    // сама проверка мне понятна - сравниваем введенный знак (+, -, *, /) и делаем действие/
    // не понятно как вычленить числа и отсечь результат, чтоб проверить  

    
}
